{"inkVersion":21,"root":[["#","^External Function Declarations","/#",["done",{"#f":5,"#n":"g-0"}],null],"done",{"0_0_0_Intro":["#","^blackout on","/#","#","^speakers Player Professor","/#","^Player: Professor, for this Survey in Bayvan… is it just a few sample points and a report?","\n","^Player: Sounds like my thesis will be easier than I thought.","\n","^The Professor doesn’t turn around right away, pausing mid-motion.","\n","^Professor: …Samples, yes. But records, too.","\n","^He turns to face you, holding a slightly worn, intricately structured device.","\n","^Professor: Use this. The core recording unit.","\n","^Player: The Sphere? Isn’t that… the old ‘Living Recorder’ project that got shelved? I heard there were… incidents.","\n","^Professor: It records resonance. Truth deeper than numbers… Especially after disasters.","\n","^Research my thesis using that blacklisted device? Well… He knew about those accident briefings and never said a word.","\n","^Bayvan… Is there something there for you, Professor?","\n","done",{"#f":1}],"0_1_0_VC_Outside":["^Bayvan Visitor Center exterior.","\n","^Sunlight blazes down, waves dull and listless, with something stirring in the air.","\n","#","^speakers Player","/#","^Player: Huh, the visitor center’s newer than I expected. Not bad.","\n","^Player: Though that murky sea… the dead pier… and that smell in the air…","\n","^Player: Seems Professor really brought something for me.","\n","^Player: Guess I'd better go find Ms. Ella. He said she’s handling my onboarding.","\n","^Player: Let's see if there's anyone in the visitor center that knows where she is.","\n","done",{"#f":1}],"0_1_1_VC_Broadcast":["^A sweet voice from a speaker:","\n","^Welcome to Bayvan Eco-Park! Experience pristine nature and enjoy the harmony of coexistence! Today’s feature: “The Mayor and the Sea” photography exhibit—relive our pioneer glory!","\n","#","^speakers Player","/#","^Player: Pristine? Coexistence? Really?… Hey Sphere, you’re the “Living Recorder.” Got anything to say?","\n","done",{"#f":1}],"0_1_2_FrontDesk":["#","^speakers Player FD","/#","^Front Desk: ...Yes, yes, Ella! The person is here—looks like a student... holding a weird ball? ...Got it, I'll say you were delayed by an urgent interview at the sewage plant, and tell him to—what? Take photos of the sediment? Noted, noted!","\n","^She sees you, immediately hangs up, takes a deep breath, and forces a professional smile.","\n","^Front Desk: Sorry for the wait! Miss Ella was just called away for an urgent interview at the sewage plant! She apologizes and said you can go meet her directly in the new district!","\n","^She hands you a business card.","\n","^Front Desk: Here's the address, it's really easy to find!","\n","#","^show_popup \"Received Ella name card\"","/#","#","^add_notebook Ella_name_card","/#","^You take the note. Suddenly, your phone vibrates violently in your pocket.","\n","^Player: ...?","\n","^Player: Urgent interview at the sewage plant? Seriously...?","\n","^Your phone screen lights up—a new email.","\n","#","^show_popup \"Received UnknownMail\"","/#","#","^add_notebook UnknownMail","/#","#","^show_item UnknownMail","/#","^Sender: [Data Deleted], Subject: For the person with the sphere.","\n","^Email Body: Research station, Basement Level 3, Section B, sample port of the recirculating water tank. This is a real water sample. Don’t trust their \"qualified\" report. The arsenic adsorption data was manually smoothed. The attachment is the original graph.","\n","^Email Body: (Attachment: An arsenic concentration monitoring line chart. Most of the line is a smooth green, but one point is circled in red, showing a sudden spike. Beside it is a small note: Sample Point: Yucun Majiajing – 7/14.)","\n","^Player: (pupils contract, finger sliding across that glaring red spike on the screen):","\n","^Player: Manually smoothed...? Qiu? The genius sampler Professor mentioned—the one who left the project? He sent me an email? Arsenic... Fisherman’s Village Well?","\n","ev",0,1,"str","^phone_call","/str",{"x()":"SET_FLAG","exArgs":3},"pop","/ev","\n","end",{"#f":1}],"0_1_3_VC_Mateo1":["^At the dock, a disheveled, middle-aged man hurls a bucket of rotting fish onto the deck of a shiny new tourist yacht.","\n","^The fish gills shimmer with strange metallic blue blotches. Several Bayvan tourism staff are around him.","\n","#","^speakers Mateo Security","/#","^Security A: Mateo! What the hell?! The tourists are watching!","\n","^Mateo: Let them watch! The blue on those gills? Same crap from your discharge pipes!","\n","^Mateo: Three years! What did you bring to us?! Huh?!","\n","^Security B: Everything was fine! The experts said it’s a rare red tide—","\n","^Mateo: Red tide?! The fish Noah pulled out before he died looked just like this! You gonna say he drowned in a “rare red tide” too?!","\n","^The moment he says “Noah,” their faces twist. Movements freeze.","\n","^In the chaos, Mateo’s bloodshot eyes lock on the Sphere in your hands.","\n","^Mateo: Another damn recorder?! Fine! Great! Tell those lab coats this——Their “clean” data can’t keep a single fish alive.","\n","^Mateo: And sure as hell can’t bring Noah back!","\n","^The beach fell silent.","\n","^The orb trembling slightly in your hands, cloudy swirls rising inside it.","\n","#","^enable sphere","/#","#","^show_popup \"EcoSphere is now active\"","/#","done",{"#f":1}],"0_2_0_Q2":["#","^speakers Player Qiu","/#","^Outside the Baylan Laboratory of Environments.","\n","^You walk across a gravel path and spot a man standing at the gate.","\n","^Player: Excuse me… Are you Mr Qiu? My Professor said a senior researcher was stationed here.","\n","^Player: He also asked me to bring this along—said maybe it could still be of use.","\n","^Qiu: Hmmm…Welcome.","\n","^The moment he sees the Orb on your hand, something shifts subtly in his expression.","\n","^Qiu: Well, so he still remembers it.","\n","^Qiu: It’s not that it’s useless. It’s that no one wants to be responsible for what happens after it works.","\n","^Player: You mean the incident? The files I found... they’re all redacted.","\n","^Qiu: The things you should find, you won’t. And the things you won’t find, I won’t tell.","\n","^Qiu: Let me see... if I remember correctly, it works like this...","\n","^You hand him the eco-orb. You notice the suspended particles inside begin to shift.","\n","^Under some strange force, they disassemble and recombine—gradually forming a faint, symbolic pattern.","\n","^Qiu: It activates near a live sample source. Just keep it away from strong electromagnetic fields. And whatever you do, don’t let it touch seawater.","\n","^Player: My advisor said it records \"resonance,\" not just numbers.","\n","^Qiu: Resonance is data. Just not the kind that looks good on a spreadsheet.","\n","^Qiu: But sometimes... what it shows—well, you’ll see once you start recording.","\n","^He hands the orb back and gestures toward the beach and the tourist center in the distance.","\n","^Qiu: I doubt you're here just to admire the station. Others have noticed the problem before you did.","\n","^Player: Who?","\n","^Qiu: A journalist. Name's Ella. She doesn’t wait for permission to start digging.","\n","^Player: You know her?","\n","^Qiu: She asks the kind of questions you’re carrying too. Maybe the two of you will find some answers together.","\n","^He unlocks the door to the research station, but doesn’t step inside right away.","\n","^Qiu: While you’re in Bihaven, I’ll help where I can... Just don’t expect too much.","\n","^Qiu: What you learn depends on what you’re willing to ask. But don’t take too long. Some people are running out of time.","\n","#","^show_popup(\"Qiu joined team\")","/#","#","^addtoparty Qiu","/#","done",{"#f":1}],"#f":1}],"listDefs":{}}