{"inkVersion":21,"root":[["#","^External Function Declarations","/#",["done",{"#f":5,"#n":"g-0"}],null],"done",{"0_0_0_Intro":["#","^blackout on","/#","#","^speakers Player Professor","/#","^Player: Professor, for this Survey in Bayvan… is it just a few sample points and a report?","\n","^Player: Sounds like my thesis is going to be easier than I thought.","\n","^The Professor doesn’t turn around right away, pausing mid-motion.","\n","^Professor: …Samples, yes. Records, too.","\n","^He turns to face you, holding a slightly worn, intricately structured device.","\n","^Professor: Use this. The core recording unit.","\n","^Player: The Sphere? Isn’t that… the old ‘Living Recorder’ project that got shelved? I heard there were… incidents.","\n","^Professor: It records resonance. Truer than data…Especially after disasters.","\n","^Research my thesis using that blacklisted device? Well… He knew the accident briefings and never brought them up.","\n","^Bayvan… Is there something significant there for you?","\n","done",{"#f":1}],"0_1_0_VC_Outside":["^Bayvan Visitor Center exterior.","\n","^The sunlight is glaring, the waves dull, along with some slight undercurrent in the air.","\n","#","^speakers Player","/#","^Player: Huh, the visitor center’s newer than I expected. Not bad.","\n","^Player: Though that murky sea… the dead pier… and that smell in the air…","\n","^Player: Seems Professor really brought something for me.","\n","^Player: Guess I'd better go find Ms. Ella. He said she’s handling my onboarding.","\n","^Player: Let's see if the visitor center has a map for this place.","\n","done",{"#f":1}],"0_1_1_VC_Broadcast":["^A sweet voice from a speaker:","\n","^Welcome to Bayvan Eco-Park! Experience pristine nature and enjoy the harmony of coexistence! Today’s feature: “The Mayor and the Sea” photography exhibit—relive our pioneer glory!","\n","#","^speakers Player","/#","^Player: Pristine? Coexistence? Really?… Eco-orb, you’re the “Living Recorder.” Got anything to say?","\n","done",{"#f":1}],"0_1_2_front_desk":["#","^speakers Player FD","/#","^FD: ...Yes, yes, Ella! The person is here—looks like a student... holding a weird ball? ...Got it, I'll say you were delayed by an urgent interview at the sewage plant, and tell him to—what? Take photos of the sediment? Noted, noted!","\n","^She sees you, immediately hangs up, takes a deep breath, and forces a professional smile.","\n","^FD: Sorry for the wait! Miss Ella was just called away for an urgent interview at the sewage plant! She apologizes and said you can go meet her directly in the new district!","\n","^She hands you a city map and a business card.","\n","^FD: It's at this address, really easy to find!","\n","#","^show_popup \"Received Map\"","/#","#","^Enable Map","/#","#","^show_popup \"Received Ella name card\"","/#","#","^add_notebook Ella_name_card","/#","^You take the note. Suddenly, your phone vibrates violently in your pocket.","\n","^Player: ...?","\n","^Player: Urgent interview at the sewage plant? Really...?","\n","^Your phone screen lights up—a new email. Sender: [Data Deleted], Subject: For the person with the ball.","\n","#","^show_popup \"Received UnknownMail\"","/#","#","^add_notebook UnknownMail","/#","#","^show_item UnknownMail","/#","^An Unknown Mail","\n","^Email Body: Research station, Basement Level 3, Section B, sample port of the recirculating water tank. This is a real water sample. Don’t trust their \"qualified\" report. The arsenic adsorption data was manually smoothed. The attachment is the original graph.","\n","^Email Body: (Attachment: An arsenic concentration monitoring line chart. Most of the line is a smooth green, but one point is circled in red, showing a sudden spike. Beside it is a small note: Sample Point: Yucun Majiajing – 7/14.)","\n","^Player: (pupils contract, finger sliding across that glaring red spike on the screen):","\n","^Player: Manually smoothed...? Qiu? The genius sampler Professor mentioned—the one who left the project? He sent me an email? Arsenic... Yucun Majiajing?","\n","end",{"#f":1}],"0_1_3_VC_MateoConflict":["^At the dock, a disheveled, middle-aged man hurls a bucket of rotting fish onto the deck of a shiny new tourist yacht!","\n","^The fish gills shimmer with strange metallic blue blotches. Several Bayvan tourism staff are around him.","\n","#","^speakers Mateo Security","/#","^Security A: Mateo! What the hell?! The tourists are watching!","\n","^Mateo: Let them watch! The blue on those gills? Same crap from your discharge pipes!","\n","^Mateo: Three years! What did you bring to us?! Huh?!","\n","^Security B: Everything was fine! The experts said it’s a rare red tide—","\n","^Mateo: Red tide?! The fish Noah pulled out before he died looked just like this! You gonna say he drowned in a “rare red tide” too?!","\n","^The moment he says “Noah,” their faces twist. Movements freeze.","\n","^In the chaos, Mateo’s bloodshot eyes lock on the Sphere in your hands.","\n","^Mateo: Another damn recorder?! Fine! Great! Tell those lab coats this——Their “clean” data can’t keep a single fish alive.","\n","^Mateo: And sure as hell can’t bring Noah back!","\n","^The beach  falls silent.","\n","^You alone notice the orb trembling slightly in your hands, cloudy swirls rising inside it.","\n","#","^enable UI Orb","/#","#","^show_popup \"EcoSphere is now active\"","/#","done",{"#f":1}],"#f":1}],"listDefs":{}}