{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"0_1_2_front_desk":["#","^speakers Player FD","/#","^FD: ...Yes, yes, Ella! The person is here—looks like a student... holding a weird ball? ...Got it, I'll say you were delayed by an urgent interview at the sewage plant, and tell him to—what? Take photos of the sediment? Noted, noted!","\n","^She sees you, immediately hangs up, takes a deep breath, and forces a professional smile.","\n","^FD: Sorry for the wait! Miss Ella was just called away for an urgent interview at the sewage plant! She apologizes and said you can go meet her directly in the new district!","\n","^She hands you a city map and a business card.","\n","^FD: It's at this address, really easy to find!","\n","#","^show_popup \"Received Map\"","/#","#","^Enable Map","/#","#","^show_popup \"Received Ella name card\"","/#","#","^add_notebook Ella_name_card","/#","^You take the note. Suddenly, your phone vibrates violently in your pocket.","\n","^Player: ...?","\n","^Player: Urgent interview at the sewage plant? Really...?","\n","^Your phone screen lights up—a new email. Sender: [Data Deleted], Subject: For the person with the ball.","\n","#","^show_popup \"Received UnknownMail\"","/#","#","^add_notebook UnknownMail","/#","#","^show_item UnknownMail","/#","^An Unknown Mail","\n","^Email Body: Research station, Basement Level 3, Section B, sample port of the recirculating water tank. This is a real water sample. Don’t trust their \"qualified\" report. The arsenic adsorption data was manually smoothed. The attachment is the original graph.","\n","^Email Body: (Attachment: An arsenic concentration monitoring line chart. Most of the line is a smooth green, but one point is circled in red, showing a sudden spike. Beside it is a small note: Sample Point: Yucun Majiajing – 7/14.)","\n","^Player: (pupils contract, finger sliding across that glaring red spike on the screen):","\n","^Player: Manually smoothed...? Qiu? The genius sampler Professor mentioned—the one who left the project? He sent me an email? Arsenic... Yucun Majiajing?","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}